app/Models/manage/Category_model.php

    public function getCategory($id = false)
    {
        if($id === false){
            return $this->findAll();
        }else{
            return $this->getWhere(['id' => $id]);
---
SELECT *
FROM `category`
SELECT *
FROM `category`
WHERE `id` = '1'