app/Models/manage/Info_model.php

    public function getInfo($id = 1)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table($this->table);
        $builder->where('info.id', $id);
        $query   = $builder->get();
---
SELECT *
FROM `info`
WHERE `info`.`id` = 1