app/Models/manage/MenuItem_model.php

    public function getMenuItem($id = false)
    {
        if($id === false){
            return $this->findAll();
        }else{
            $db      = \Config\Database::connect();
            $builder = $db->table($this->table);
            $builder->select('menu_item.*');
            $builder->join('menu', 'menu.id = menu_item.menu_id');
            $builder->where('menu_item.menu_id', $id);
            $query = $builder->get();
---
SELECT `menu_item`.*
FROM `menu_item`
JOIN `menu` ON `menu`.`id` = `menu_item`.`menu_id`
WHERE `menu_item`.`menu_id` = '1'