app/Models/manage/Menu_model.php

SELECT *
FROM `menu`
SELECT *
FROM `menu`
WHERE `id` = '1'
---
    public function getMenu($id = false)
    {
        if($id === false){
            return $this->findAll();
        }else{
            return $this->getWhere(['id' => $id]);