app/Models/manage/Option_model.php

    public function getOption($name = false)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table($this->table);
        if($name === false){
            $builder->select('options.*');
            $query = $builder->get();
---
SELECT `options`.*
FROM `options`

    public function updateOption($data)
    {
        foreach($data as $key){
            foreach($key as $k => $value){
                $data = array('value'=>$value);
                $this->db->table($this->table)->update($data, array('name' => str_replace("'","",$k)));
---
UPDATE `options` SET `value` = 'smtp'
WHERE `name` = 'mail_protocol'