app/Models/manage/Page_model.php

SELECT `page`.*, `user`.`nicename` as `username`
FROM `page`
JOIN `user` ON `user`.`id` = `page`.`authorid`
---
    public function getPage($id = false)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table($this->table);
        if($id === false){
            $builder->select('page.*, user.lastname as username');
            $builder->join('user', 'user.id = page.authorid');
            $query = $builder->get();

SELECT COUNT(*) AS `numrows`
FROM `page`
---
    public function countAll(){
        $query = $this->countAllResults();

SELECT `page`.*, `user`.`nicename` as `username`
FROM `page`
JOIN `user` ON `user`.`id` = `page`.`authorid`
WHERE `page`.`published` = 0
---
    public function getPageDraft(){
        $db      = \Config\Database::connect();
        $builder = $db->table($this->table);
        $builder->select('page.*, user.lastname as username');
        $builder->join('user', 'user.id = page.authorid');
        $builder->where('page.published', 0);
        $query = $builder->get();

SELECT COUNT(*) AS `numrows`
FROM `page`
WHERE `published` = 0
---
    public function getCountPageDraft(){
        $query = $this->where(['published' => 0])->countAllResults();

SELECT `page`.*, `user`.`nicename` as `username`
FROM `page`
JOIN `user` ON `user`.`id` = `page`.`authorid`
WHERE `page`.`published` = 1
---
    public function getPagePublish(){
        $db      = \Config\Database::connect();
        $builder = $db->table($this->table);
        $builder->select('page.*,  user.lastname as username');
        $builder->join('user', 'user.id = page.authorid');
        $builder->where('page.published', 1);
        $query = $builder->get();

SELECT COUNT(*) AS `numrows`
FROM `page`
WHERE `published` = 1
---
    public function getCountPagePublish(){
        $query = $this->where(['published' => 1])->countAllResults();