app/Models/manage/Permission_model.php

    public function getPermission($id = false)
    {
        if($id === false){
            $db      = \Config\Database::connect();
            $builder = $db->table($this->table);
            $builder->select('permission.*, user_group.name as grname');
            $builder->join('user_group','user_group.id = permission.group_id');
            $query = $builder->get();
            return $query->getResultArray();
        }else{
            $db      = \Config\Database::connect();
            $builder = $db->table($this->table);
            $builder->select('permission.*, user_group.name as grname');
            $builder->join('user_group','user_group.id = permission.group_id');
            $builder->where('user_group.id', $id);
            $query = $builder->get();
---
SELECT `permission`.*, `user_group`.`name` as `grname`
FROM `permission`
JOIN `user_group` ON `user_group`.`id` = `permission`.`group_id`
WHERE `user_group`.`id` = '2'