app/Models/manage/Post_model.php

SELECT `post`.*, `category`.`title` as `cattitle`, `user`.`nicename` as `username`
FROM `post`
JOIN `category` ON `category`.`id` = `post`.`parentid`
JOIN `user` ON `user`.`id` = `post`.`authorid`
ORDER BY `id` DESC
---
    public function getPost($id = false)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table($this->table);

        if($id === false){
            $builder->select('post.*, category.title as cattitle, user.nicename as username');
            $builder->join('category', 'category.id = post.parentid');
            $builder->join('user', 'user.id = post.authorid');
            $builder->orderBy('id', 'DESC');
            $query = $builder->get();

SELECT COUNT(*) AS `numrows` FROM `post`
---
    public function countAll(){
        $query = $this->db->table($this->table);
        return $query->countAll();

SELECT `post`.*, `category`.`title` as `cattitle`, `user`.`nicename` as `username`
FROM `post`
JOIN `category` ON `category`.`id` = `post`.`parentid`
JOIN `user` ON `user`.`id` = `post`.`authorid`
WHERE `post`.`published` = 1
ORDER BY `id` DESC
---
    public function getPostPublish(){
        $db      = \Config\Database::connect();
        $builder = $db->table($this->table);
        $builder->select('post.*, category.title as cattitle, user.nicename as username');
        $builder->join('category', 'category.id = post.parentid');
        $builder->join('user', 'user.id = post.authorid');
        $builder->where('post.published', 1);
        $builder->orderBy('id', 'DESC');
        $query = $builder->get();

SELECT COUNT(*) AS `numrows`
FROM `post`
WHERE `published` = 1
---
    public function getCountPostPublish(){
        $query = $this->where(['published' => 1])->countAllResults();

SELECT `post`.*, `category`.`title` as `cattitle`, `user`.`nicename` as `username`
FROM `post`
JOIN `category` ON `category`.`id` = `post`.`parentid`
JOIN `user` ON `user`.`id` = `post`.`authorid`
WHERE `trash` = 1
ORDER BY `id` DESC
---
    public function getPostTrash(){
        $db      = \Config\Database::connect();
        $builder = $db->table($this->table);
        $builder->select('post.*, category.title as cattitle, user.nicename as username');
        $builder->join('category', 'category.id = post.parentid');
        $builder->join('user', 'user.id = post.authorid');
        $builder->where('trash', 1);
        $builder->orderBy('id', 'DESC');
        $query = $builder->get();

SELECT COUNT(*) AS `numrows`
FROM `post`
WHERE `trash` = 1
---
    public function getCountPostTrash(){
        $query = $this->where(['trash' => 1])->countAllResults();

SELECT `post`.*, `category`.`title` as `cattitle`, `user`.`nicename` as `username`
FROM `post`
JOIN `category` ON `category`.`id` = `post`.`parentid`
JOIN `user` ON `user`.`id` = `post`.`authorid`
WHERE `post`.`published` = 0
AND `post`.`trash` = 0
ORDER BY `id` DESC
---
    public function getPostDraft(){
        $db      = \Config\Database::connect();
        $builder = $db->table($this->table);
        $builder->select('post.*, category.title as cattitle, user.nicename as username');
        $builder->join('category', 'category.id = post.parentid');
        $builder->join('user', 'user.id = post.authorid');
        $builder->where('post.published', 0);
        $builder->where('post.trash', 0);
        $builder->orderBy('id', 'DESC');
        $query = $builder->get();

SELECT COUNT(*) AS `numrows`
FROM `post`
WHERE `published` = 0
AND `trash` = 0
---
    public function getCountPostDraft(){
        $query = $this->where(['published' => 0, 'trash' => 0])->countAllResults();