app/Models/manage/Seo_model.php

    public function getseo($id = false, $type = false)
    {
        if($id === false){
            return $this->findAll();
        }else{
            return $this->getWhere(['content_id' => $id, 'content_type' => $type]);
---
SELECT `seo`.*
FROM `seo`
ORDER BY `id` DESC

    public function updateseo($data, $id)
    {
        $query = $this->db->table($this->table)->update($data, array('id' => $id));
---
UPDATE `seo` SET `meta_title` = 'Tin công nghệ', `meta_description` = 'Tin công nghệ cập nhật mới nhất'
WHERE `id` = '1'