app/Models/manage/User_model.php

SELECT `user`.*
FROM `user`
WHERE `user`.`id` = '1'
SELECT `user`.*, `user_group`.`name` as `grname`
FROM `user`
JOIN `user_group` ON `user_group`.`id` = `user`.`group_id`
ORDER BY `id` DESC
---
    public function getUser($id = false)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table($this->table);
        if($id == 1){
            $builder->select('user.*');
            $builder->where('user.id', $id);
            $query = $builder->get();
            return $query->getRow();
        }

        if($id === false){
            $builder->select('user.*, user_group.name as grname');
            $builder->join('user_group', 'user_group.id = user.group_id');
            $builder->orderBy('id', 'DESC');
            $query = $builder->get();