app/Models/manage/User_group_model.php

SELECT *
FROM `user_group`
SELECT `user_group`.*
FROM `user_group`
WHERE `id` = '2'
---
    public function getUserGroup($id = false)
    {
        if($id === false){
            return $this->findAll();
        }else{
            $db      = \Config\Database::connect();
            $builder = $db->table($this->table);
            $builder->select('user_group.*');
            $builder->where('id', $id);
            $query = $builder->get();

INSERT INTO `user_group` (`name`) VALUES ('member')
---
    public function saveUserGroup($data)
    {
        $query = $this->db->table($this->table)->insert($data);