app/Models/Option_model.php

    public function getOptions($id = false)
    {
        if($id === false){
            return $this->findAll();
---
SELECT *
FROM `options`